Acquiring state lock. This may take a few moments...
module.lambda_layer.data.archive_file.pymysql_layer: Reading...
module.lambda_layer.data.archive_file.pymysql_layer: Read complete after 0s [id=fdbcd5e1107f297ea43bc9c2c8cf137dabe8d5aa]
module.iam.aws_iam_role.eks_node_role: Refreshing state... [id=EKSNodeInstanceRole]
module.nat.aws_eip.nat_eip: Refreshing state... [id=eipalloc-019fe77b2e5c3029d]
module.iam.aws_iam_role.eks_cluster_role: Refreshing state... [id=EKSClusterRole]
module.lambda_layer.aws_lambda_layer_version.pymysql: Refreshing state... [id=arn:aws:lambda:ap-northeast-2:635140758252:layer:pymysql-layer:28]
module.iam.aws_iam_policy.lambda_vpc_access_policy: Refreshing state... [id=arn:aws:iam::635140758252:policy/lambda_vpc_access_policy]
module.iam.aws_iam_role.lambda_exec_role: Refreshing state... [id=lambda_sql_initializer_role]
module.docker_images.aws_cloudwatch_event_rule.lambda_schedule_rule: Refreshing state... [id=news-crawler-schedule-rule]
module.iam.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::635140758252:policy/lambda_sql_initializer_policy]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-036e78f67b3e36fe4]
module.iam.aws_iam_role_policy_attachment.lambda_vpc_policy_attachment: Refreshing state... [id=lambda_sql_initializer_role-20250612002235867500000003]
module.iam.aws_iam_role_policy_attachment.lambda_policy_attachment: Refreshing state... [id=lambda_sql_initializer_role-20250612002235830200000001]
module.iam.aws_iam_role_policy_attachment.eks_cluster_attach: Refreshing state... [id=EKSClusterRole-20250612002235848200000002]
module.iam.aws_iam_role_policy_attachment.eks_cni: Refreshing state... [id=EKSNodeInstanceRole-20250612002235911500000006]
module.iam.aws_iam_role_policy_attachment.ec2_container_registry_read_only: Refreshing state... [id=EKSNodeInstanceRole-20250612002235873700000004]
module.iam.aws_iam_role_policy_attachment.eks_worker_node: Refreshing state... [id=EKSNodeInstanceRole-20250612002235876500000005]
module.igw.aws_internet_gateway.this: Refreshing state... [id=igw-01fea8724c9e563de]
module.subnet.aws_subnet.private_3b: Refreshing state... [id=subnet-08be277d89ac074bc]
module.security_group.aws_security_group.rds_sg: Refreshing state... [id=sg-08bfee550b2d3a8cf]
module.subnet.aws_subnet.private_4d: Refreshing state... [id=subnet-0dcd4c23f039aec0d]
module.security_group.aws_security_group.app_sg: Refreshing state... [id=sg-02907065ad562078c]
module.route.aws_route_table.public: Refreshing state... [id=rtb-0bced304933c4c3cd]
module.route.aws_route_table.private: Refreshing state... [id=rtb-0fa2522162af99180]
module.subnet.aws_subnet.public_2c: Refreshing state... [id=subnet-045fa82634ae14b40]
module.subnet.aws_subnet.public_1a: Refreshing state... [id=subnet-0f8675eb794cfce16]
module.route.aws_route.public_route: Refreshing state... [id=r-rtb-0bced304933c4c3cd1080289494]
module.route.aws_route_table_association.private_1: Refreshing state... [id=rtbassoc-0d4c2d534766b252e]
module.route.aws_route_table_association.private_2: Refreshing state... [id=rtbassoc-0e379f5c0af71ab88]
module.eks.aws_ecr_lifecycle_policy.spring_app: Refreshing state... [id=spring-app]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=news-rds]
module.nat.aws_nat_gateway.nat: Refreshing state... [id=nat-0fcec4e81158a96a3]
module.route.aws_route_table_association.public_1: Refreshing state... [id=rtbassoc-0388404f76ab71636]
module.route.aws_route_table_association.public_2: Refreshing state... [id=rtbassoc-0452ff74d07f319f3]
module.eks.aws_eks_cluster.this: Refreshing state... [id=news-cluster]
module.route.aws_route.private_route: Refreshing state... [id=r-rtb-0fa2522162af991801080289494]
module.eks.aws_eks_node_group.default: Refreshing state... [id=news-cluster:news-cluster-ng]
module.rds.aws_db_instance.this: Refreshing state... [id=db-FC57PSSILZNYU7BP4JIIUJN77Y]
module.sending_news.data.archive_file.lambda_zip: Reading...
module.sending_news.aws_cloudwatch_event_rule.weekday_hourly_trigger: Refreshing state... [id=send-news-lambda-weekday-trigger]
module.sending_news.data.archive_file.lambda_zip: Read complete after 0s [id=3bacbceb8770fe098e92cb837da1d197c6246a9d]
module.sql_initializer.data.archive_file.lambda_zip: Reading...
module.docker_images.aws_lambda_function.news-crawler_mw: Refreshing state... [id=news-crawler-lambda]
module.sending_news.aws_lambda_function.this: Refreshing state... [id=news-lambda-handler]
module.sql_initializer.data.archive_file.lambda_zip: Read complete after 0s [id=c105752a6395f83aa7883a789b1664b45fc19767]
module.sql_initializer.aws_lambda_function.sql_initializer: Refreshing state... [id=rds-sql-initializer]
module.docker_images.aws_lambda_permission.allow_eventbridge: Refreshing state... [id=AllowExecutionFromEventBridge]
module.docker_images.aws_cloudwatch_event_target.lambda_target: Refreshing state... [id=news-crawler-schedule-rule-lambda-news-crawler]
module.sending_news.aws_lambda_permission.allow_cloudwatch: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.sending_news.aws_cloudwatch_event_target.lambda_target: Refreshing state... [id=send-news-lambda-weekday-trigger-send-news-lambda]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.eks.aws_eks_cluster.this will be updated in-place
  ~ resource "aws_eks_cluster" "this" {
        id                            = "news-cluster"
        name                          = "news-cluster"
        tags                          = {
            "Name" = "news-cluster"
        }
        # (12 unchanged attributes hidden)

      ~ vpc_config {
          ~ subnet_ids                = [
              - "subnet-08be277d89ac074bc",
              - "subnet-0dcd4c23f039aec0d",
              + "subnet-045fa82634ae14b40",
              + "subnet-0f8675eb794cfce16",
            ]
            # (6 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.eks.aws_eks_node_group.default must be replaced
-/+ resource "aws_eks_node_group" "default" {
      ~ ami_type               = "AL2023_x86_64_STANDARD" -> (known after apply)
      ~ arn                    = "arn:aws:eks:ap-northeast-2:635140758252:nodegroup/news-cluster/news-cluster-ng/c4cbb0c5-3b1b-cb0a-69e7-6894bfb81f00" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 20 -> (known after apply)
      ~ id                     = "news-cluster:news-cluster-ng" -> (known after apply)
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "1.32.3-20250610" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-news-cluster-ng-c4cbb0c5-3b1b-cb0a-69e7-6894bfb81f00"
                    },
                ]
              - remote_access_security_group_id = "sg-039ee92ff64b4de6b"
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
      ~ subnet_ids             = [ # forces replacement
          - "subnet-08be277d89ac074bc",
          - "subnet-0dcd4c23f039aec0d",
          + "subnet-045fa82634ae14b40",
          + "subnet-0f8675eb794cfce16",
        ]
        tags                   = {
            "Name" = "news-cluster-ng"
        }
      ~ version                = "1.32" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ node_repair_config (known after apply)

      ~ remote_access {
          - source_security_group_ids = [] -> null
            # (1 unchanged attribute hidden)
        }

      ~ update_config (known after apply)
      - update_config {
          - max_unavailable            = 1 -> null
          - max_unavailable_percentage = 0 -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "db_password" but a value
was found in file "terraform.auto.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

<!-- Sticky Pull Request Comment -->